In [1]:
import json
import pandas as pd
import numpy as np
import re
from sqlalchemy import create_engine
from config import db_password
import time

In [2]:
file_dir = '../04222021-CleanedMHinTechData.csv'

In [3]:
f'{file_dir}filename'

'../04222021-CleanedMHinTechData.csvfilename'

In [4]:
file_dir_2 = '../salaries.csv'

In [5]:
mh_df=pd.read_csv('04222021-CleanedMHinTechData.csv', low_memory=False)
salaries_df=pd.read_csv('salaries.csv')

In [6]:
mh_df.head()

,self_employed,company_size,tech_company,primary_tech_role,mh_coverage_benefits,knowledge_mh_options,mh_communication,mh_resources,mh_anonymity,ease_mh_help_request,...,Unnamed: 68,Unnamed: 69,Unnamed: 70,Unnamed: 71,Unnamed: 72,Unnamed: 73,Unnamed: 74,Unnamed: 75,Unnamed: 76,Unnamed: 77
0,0,26-100,1.0,NaN,Not eligible for coverage / N/A,NaN,No,No,I don't know,Very easy,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0,25-Jun,1.0,NaN,No,Yes,Yes,Yes,Yes,Somewhat easy,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,0,25-Jun,1.0,NaN,No,NaN,No,No,I don't know,Neither easy nor difficult,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,0,25-Jun,0.0,1.0,Yes,Yes,No,No,No,Neither easy nor difficult,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
salaries_df.head()

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
0,3/21/2016 13:32,NaN,0,NaN,0,0,0,0.0,0.0,-,Male,NaN
1,3/21/2016 14:39,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN,NaN
2,3/22/2016 14:01,1,1,NaN,1,1,1,1.0,1.0,1,Male,NaN
3,3/21/2016 14:05,NaN,NaN,NaN,NaN,NaN,2,NaN,NaN,NaN,NaN,NaN
4,3/22/2016 16:29,Intercom,Product Engineer,NaN,2,6,90000,10000.0,10000.0,"10,000.00",Female,NaN

In [8]:
mh_df.sample()

,self_employed,company_size,tech_company,primary_tech_role,mh_coverage_benefits,knowledge_mh_options,mh_communication,mh_resources,mh_anonymity,ease_mh_help_request,...,Unnamed: 68,Unnamed: 69,Unnamed: 70,Unnamed: 71,Unnamed: 72,Unnamed: 73,Unnamed: 74,Unnamed: 75,Unnamed: 76,Unnamed: 77
272,0,More than 1000,1.0,NaN,Yes,Yes,Yes,Yes,Yes,Somewhat easy,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
mh_df.tail()

,self_employed,company_size,tech_company,primary_tech_role,mh_coverage_benefits,knowledge_mh_options,mh_communication,mh_resources,mh_anonymity,ease_mh_help_request,...,Unnamed: 68,Unnamed: 69,Unnamed: 70,Unnamed: 71,Unnamed: 72,Unnamed: 73,Unnamed: 74,Unnamed: 75,Unnamed: 76,Unnamed: 77
1428,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1429,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1430,0,100-500,1.0,NaN,Yes,Yes,Yes,Yes,I don't know,Somewhat difficult,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1431,0,100-500,0.0,1.0,I don't know,I am not sure,No,Yes,I don't know,Somewhat difficult,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1432,0,100-500,1.0,NaN,Yes,No,No,No,I don't know,Very difficult,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
salaries_df.tail()

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
3330,3/21/2016 14:32,aaaa,aaaa,NaN,12,12,123123,12.0,12.0,123,Male,adasd
3331,3/21/2016 15:17,NaN,NaN,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
3332,8/11/2017 6:27,NaN,NaN,NaN,NaN,NaN,10,NaN,NaN,NaN,NaN,NaN
3333,3/21/2016 13:02,NaN,NaN,NaN,NaN,NaN,80000,NaN,NaN,NaN,NaN,NaN
3334,3/21/2016 22:50,NaN,NaN,NaN,NaN,NaN,23423,NaN,NaN,NaN,NaN,NaN

In [11]:
salaries_df.columns.tolist()

['Timestamp',
 'Employer',
 'Location',
 'Job Title',
 'Years at Employer',
 'Years of Experience',
 'Annual Base Pay',
 'Signing Bonus',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Gender',
 'Additional Comments']

In [12]:
salaries_df[salaries_df['Job Title'].notnull()]

,Timestamp,Employer,Location,Job Title,Years at Employer,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Annual Stock Value/Bonus,Gender,Additional Comments
6,3/21/2016 15:19,Crittercism,"San Francisco, CA",Engineer,3,9,135000,0.0,6000.0,"50,000.00",Male,NaN
7,3/21/2016 13:16,NaN,London,Programmer,0.3,0,30187,0.0,0.0,-,Male,NaN
19,3/21/2016 14:03,Domo,"American Fork, UT",Account Executive,1,5,80000,25000.0,140000.0,"50,000.00",Male,NaN
20,3/21/2016 14:24,Eastman Chemical Company,"Kingsport, TN",Accountant,2,2,62000,2500.0,NaN,NaN,Male,NaN
21,3/21/2016 14:24,NaN,New York,Ad Ops Coordinator,1,1,55000,0.0,0.0,"20,000.00",Male,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
3323,3/23/2016 0:37,microsoft,VIenna,Working Student,1,1,1400,NaN,NaN,NaN,Male,NaN
3324,3/21/2016 15:14,NaN,NaN,xxx,NaN,NaN,75000,NaN,NaN,NaN,NaN,NaN
3325,3/21/2016 13:01,NaN,NaN,zz,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
3326,3/21/2016 15:35,NaN,NaN,zz,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
3327,3/22/2016 22:03,NaN,NaN,zz,NaN,NaN,23,NaN,NaN,NaN,Male,NaN

In [13]:
sorted(salaries_df.columns.tolist())

['Additional Comments',
 'Annual Base Pay',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Employer',
 'Gender',
 'Job Title',
 'Location',
 'Signing Bonus',
 'Timestamp',
 'Years at Employer',
 'Years of Experience']

In [14]:
[[column,salaries_df[column].isnull().sum()] for column in salaries_df.columns]

[['Timestamp', 0],
 ['Employer', 1547],
 ['Location', 461],
 ['Job Title', 26],
 ['Years at Employer', 326],
 ['Years of Experience', 290],
 ['Annual Base Pay', 0],
 ['Signing Bonus', 1138],
 ['Annual Bonus', 1037],
 ['Annual Stock Value/Bonus', 1444],
 ['Gender', 159],
 ['Additional Comments', 2873]]

In [15]:
[column for column in salaries_df.columns if salaries_df[column].isnull().sum() < len(salaries_df) * 0.9]

['Timestamp',
 'Employer',
 'Location',
 'Job Title',
 'Years at Employer',
 'Years of Experience',
 'Annual Base Pay',
 'Signing Bonus',
 'Annual Bonus',
 'Annual Stock Value/Bonus',
 'Gender',
 'Additional Comments']

In [16]:
salaries_columns_to_keep = [column for column in salaries_df.columns if salaries_df[column].isnull().sum() < len(salaries_df) * 0.9]
salaries_df = salaries_df[salaries_columns_to_keep]

In [17]:
salaries_df.dtypes

Timestamp                    object
Employer                     object
Location                     object
Job Title                    object
Years at Employer            object
Years of Experience          object
Annual Base Pay               int64
Signing Bonus               float64
Annual Bonus                float64
Annual Stock Value/Bonus     object
Gender                       object
Additional Comments          object
dtype: object

In [18]:
annual_base_pay = salaries_df['Annual Base Pay'].dropna()

In [19]:
salaries_df.drop(['Timestamp', 'Employer','Additional Comments','Years at Employer','Annual Stock Value/Bonus'], axis=1)

,Location,Job Title,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Gender
0,0,NaN,0,0,0.0,0.0,Male
1,NaN,NaN,NaN,0,NaN,NaN,NaN
2,1,NaN,1,1,1.0,1.0,Male
3,NaN,NaN,NaN,2,NaN,NaN,NaN
4,Product Engineer,NaN,6,90000,10000.0,10000.0,Female
...,...,...,...,...,...,...,...
3330,aaaa,NaN,12,123123,12.0,12.0,Male
3331,NaN,NaN,NaN,1,NaN,NaN,NaN
3332,NaN,NaN,NaN,10,NaN,NaN,NaN
3333,NaN,NaN,NaN,80000,NaN,NaN,NaN
3334,NaN,NaN,NaN,23423,NaN,NaN,NaN

In [21]:
salaries_df = salaries_df[['Job Title', 'Location', 'Years of Experience', 'Annual Base Pay', 'Signing Bonus', 'Annual Bonus','Gender']]
salaries_df.head()

,Job Title,Location,Years of Experience,Annual Base Pay,Signing Bonus,Annual Bonus,Gender
0,NaN,0,0,0,0.0,0.0,Male
1,NaN,NaN,NaN,0,NaN,NaN,NaN
2,NaN,1,1,1,1.0,1.0,Male
3,NaN,NaN,NaN,2,NaN,NaN,NaN
4,NaN,Product Engineer,6,90000,10000.0,10000.0,Female

In [24]:
salaries_df = salaries_df.rename(columns={'Job Title': 'position'})

In [22]:
# Examining Job Title of Salaries Df
salaries_df['Job Title'].value_counts()

Software Engineer           513
Senior Software Engineer    187
Software Developer          163
Developer                    91
Engineer                     59
                           ...
Mechatronics Engineer         1
Nigger in cheif               1
Principal Web Develop         1
Marketing Lead                1
Senior DBA (MSSQL)            1
Name: Job Title, Length: 1203, dtype: int64

In [23]:
# Examining Job Title of MH Df
mh_df['position'].value_counts()

Back-end Developer                                                                                              263
Front-end Developer                                                                                             125
Other                                                                                                           112
Supervisor/Team Lead                                                                                             68
Back-end Developer|Front-end Developer                                                                           61
                                                                                                               ...
Other|Executive Leadership|Supervisor/Team Lead|Back-end Developer                                                1
One-person shop|Designer|Front-end Developer|Back-end Developer|Dev Evangelist/Advocate|Supervisor/Team Lead      1
Front-end Developer|Back-end Developer|Support|DevOps/SysAdmin|Executive Leadership                               1
Supervisor/Team Lead|DevOps/SysAdmin|Support|Back-end Developer                                                   1
Dev Evangelist/Advocate|DevOps/SysAdmin|Support|Back-end Developer|Front-end Developer|One-person shop            1
Name: position, Length: 264, dtype: int64

In [ ]:
pd.Series{['']}

In [ ]:
s1.str.contains('developer', flags=re.IGNORECASE, regex=True)

In [ ]:
pd.options.display.float_format = '{:20,.2f}'.format
ratings['Signing Bonus'].plot(kind='hist')
ratings['Signing Bonus'].describe()

In [ ]:
movies_df = pd.merge(wiki_movies_df, movies_metadata, on='position', suffixes=['_mh','_salaries'])

In [ ]:
movies_df[['title_wiki','title_kaggle']]

In [ ]:
movies_df[movies_df['title_wiki'] != movies_df['title_kaggle']][['title_wiki','title_kaggle']]

In [ ]:
# Show any rows where title_kaggle is empty
movies_df[(movies_df['title_kaggle'] == '') | (movies_df['title_kaggle'].isnull())]

In [ ]:
movies_df.fillna(0).plot(x='running_time', y='runtime', kind='scatter')

In [ ]:
movies_df.fillna(0).plot(x='budget_wiki',y='budget_kaggle', kind='scatter')

In [ ]:
movies_df.fillna(0).plot(x='box_office', y='revenue', kind='scatter')

In [ ]:
movies_df.fillna(0)[movies_df['box_office'] < 10**9].plot(x='box_office', y='revenue', kind='scatter')

In [ ]:
movies_df[['release_date_wiki','release_date_kaggle']].plot(x='release_date_wiki', y='release_date_kaggle', style='.')

In [ ]:
movies_df[(movies_df['release_date_wiki'] > '1996-01-01') & (movies_df['release_date_kaggle'] < '1965-01-01')]

In [ ]:
movies_df[(movies_df['release_date_wiki'] > '1996-01-01') & (movies_df['release_date_kaggle'] < '1965-01-01')].index

In [ ]:
movies_df = movies_df.drop(movies_df[(movies_df['release_date_wiki'] > '1996-01-01') & (movies_df['release_date_kaggle'] < '1965-01-01')].index)

In [ ]:
movies_df[movies_df['release_date_wiki'].isnull()]

In [ ]:
movies_df['Language'].apply(lambda x: tuple(x) if type(x) == list else x).value_counts(dropna=False)

In [ ]:
movies_df['original_language'].value_counts(dropna=False)

In [ ]:
movies_df[['Production company(s)','production_companies']]

In [ ]:
movies_df.drop(columns=['title_wiki','release_date_wiki','Language','Production company(s)'], inplace=True)

In [ ]:
def fill_missing_kaggle_data(df, kaggle_column, wiki_column):
    df[kaggle_column] = df.apply(
        lambda row: row[wiki_column] if row[kaggle_column] == 0 else row[kaggle_column]
        , axis=1)
    df.drop(columns=wiki_column, inplace=True)

In [ ]:
fill_missing_kaggle_data(movies_df, 'runtime', 'running_time')
fill_missing_kaggle_data(movies_df, 'budget_kaggle', 'budget_wiki')
fill_missing_kaggle_data(movies_df, 'revenue', 'box_office')
movies_df

In [ ]:
for col in movies_df.columns:
    lists_to_tuples = lambda x: tuple(x) if type(x) == list else x
    value_counts = movies_df[col].apply(lists_to_tuples).value_counts(dropna=False)
    num_values = len(value_counts)
    if num_values == 1:
        print(col)

In [ ]:
movies_df['video'].value_counts(dropna=False)

In [ ]:
movies_df = movies_df.loc[:, ['imdb_id','id','title_kaggle','original_title','tagline','belongs_to_collection','url','imdb_link',
                       'runtime','budget_kaggle','revenue','release_date_kaggle','popularity','vote_average','vote_count',
                       'genres','original_language','overview','spoken_languages','Country',
                       'production_companies','production_countries','Distributor',
                       'Producer(s)','Director','Starring','Cinematography','Editor(s)','Writer(s)','Composer(s)','Based on'
                      ]]

In [ ]:
movies_df.rename({'id':'kaggle_id',
                  'title_kaggle':'title',
                  'url':'wikipedia_url',
                  'budget_kaggle':'budget',
                  'release_date_kaggle':'release_date',
                  'Country':'country',
                  'Distributor':'distributor',
                  'Producer(s)':'producers',
                  'Director':'director',
                  'Starring':'starring',
                  'Cinematography':'cinematography',
                  'Editor(s)':'editors',
                  'Writer(s)':'writers',
                  'Composer(s)':'composers',
                  'Based on':'based_on'
                 }, axis='columns', inplace=True)

In [ ]:
rating_counts = ratings.groupby(['movieId','rating'], as_index=False).count()

In [ ]:
rating_counts = ratings.groupby(['movieId','rating'], as_index=False).count() \
                .rename({'userId':'count'}, axis=1)

In [ ]:
rating_counts = ratings.groupby(['movieId','rating'], as_index=False).count() \
                .rename({'userId':'count'}, axis=1) \
                .pivot(index='movieId',columns='rating', values='count')

In [ ]:
rating_counts.columns = ['rating_' + str(col) for col in rating_counts.columns]

In [ ]:
movies_with_ratings_df = pd.merge(movies_df, rating_counts, left_on='kaggle_id', right_index=True, how='left')

In [ ]:
movies_with_ratings_df[rating_counts.columns] = movies_with_ratings_df[rating_counts.columns].fillna(0)

In [ ]:
db_string = f"postgres://postgres:{db_password}@127.0.0.1:5432/movie_data"

In [ ]:
pip install psycopg2-binary

In [ ]:
engine = create_engine(db_string)

In [ ]:
movies_df.to_sql(name='movies', con=engine)

In [ ]:
rows_imported = 0
# get the start_time from time.time()
start_time = time.time()
for data in pd.read_csv(f'{file_dir}ratings.csv', chunksize=1000000):
    print(f'importing rows {rows_imported} to {rows_imported + len(data)}...', end='')
    data.to_sql(name='ratings', con=engine, if_exists='append')
    rows_imported += len(data)

    # add elapsed time to final print out
    print(f'Done. {time.time() - start_time} total seconds elapsed')